OpenFOAM/myCommentCode/OLAFOAM-master/tutorials/FE30_32/currentWaveFlume/system/setFieldsDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.3                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha1 0
    volVectorFieldValue U           (0. 0. 0.)
);

regions
(
    boxToCell
    {
        box (-10 -1 -1) (30 1 0.4);

        fieldValues
        (
            volScalarFieldValue alpha1 1
            volVectorFieldValue U           (0.75 0. 0.)
        );
    }
);
